MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
## PKA RAM erase function

- Use the HAL_PKA_RAMMassErase() function to fully erase the content of the PKA RAM.
  */
/**
  * @}
  */

/** @defgroup PKA_Configuration_Table PKA Configuration Table
  * @{
## Configuration inside the PKA driver

Config defines                | Description     |Default value  | Note                                                 |
------------------------------| ------------    |-------------  | -----------------------------------------------------|
PRODUCT                       | from IDE        |      NA       | The selected device (ex stm32c5xx )            |
USE_ASSERT_DBG_PARAM          | from IDE        |     None      | Allows to use the assert check parameters.           |
USE_ASSERT_DBG_STATE          | from IDE        |     None      | Allows to use the assert check states.               |
USE_HAL_CHECK_PARAM           | from hal_conf.h |       0       | Parameters run-time check.                           |
USE_HAL_SECURE_CHECK_PARAM    | from hal_conf.h |       0       | Parameters run-time check for sensitive APIs         |
USE_HAL_CHECK_PROCESS_STATE   | from hal_conf.h |       0       | Allows to use the load and store exclusive.          |
USE_HAL_PKA_MODULE            | from hal_conf.h |       1       | Allows to use HAL PKA module.                        |
USE_HAL_PKA_CLK_ENABLE_MODEL| from hal_conf.h |HAL_CLK_ENABLE_NO| Allows to use the clock interface management for PKA.|
USE_HAL_PKA_GET_LAST_ERRORS   | from hal_conf.h |       0       | Allows to use error code mechanism.                  |
USE_HAL_PKA_USER_DATA         | from hal_conf.h |       0       | Allows to use user data.                             |
USE_HAL_PKA_REGISTER_CALLBACKS| from hal_conf.h |       0       | Enable the register callbacks assert                 |
  */
/**
  * @}
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Private_Constants PKA Private Constants
  * @{
  */
#define PKA_RAM_SIZE                                  1334U                            /*!< PKA RAM size             */
#define PKA_INITIALIZATION_TIMEOUT                    1000UL                           /*!< 1s is the timeout for
                                                                                            initializing PKA device  */
#if defined (USE_HAL_PKA_RNG_RECOVERY) && (USE_HAL_PKA_RNG_RECOVERY == 1U)
#define PKA_RNG_TIMEOUT_VALUE                         0x2UL                            /*!< PKA RNG timeout          */
#endif /* USE_HAL_PKA_RNG_RECOVERY */

#define PKA_OPERATION_ERROR_NONE                      0xD60DUL                         /*!< Point on the curve       */
#define PKA_ROS_RESULT_MAX_SIZE                       520UL                            /*!< Max size of the RSA result
                                                                                            in bytes                 */
#define PKA_EOS_RESULT_MAX_SIZE                       80UL                             /*!< Max size of the ECC result
                                                                                            in byte                  */
#define PKA_CMP_RESULT_SIZE                           2UL                              /*!< Size of the cmp result in
                                                                                            byte                     */
#define PKA_OPERATION_NO_ERROR_OFFSET                 0UL                              /*!< PKA no result error      */
#define PKA_OPERATION_MOD_EXP_PROT_ERROR_OFFSET       PKA_MODULAR_EXP_OUT_ERROR        /*!< PKA modular exponentiation
                                                                                            (protected) result error */
#define PKA_OPERATION_ECDSA_SIGN_PROT_ERROR_OFFSET    PKA_ECDSA_SIGN_OUT_ERROR         /*!< PKA ECDSA signature result
                                                                                            error                    */
#define PKA_OPERATION_ECC_SCALAR_MUL_PROT_ERROR_OFFSET  PKA_ECC_SCALAR_MUL_OUT_ERROR     /*!< PKA ECC scalar
                                                                                            multiplication result
                                                                                            error                    */
#define PKA_OPERATION_ECC_DOUBLE_LADDER_ERROR_OFFSET  PKA_ECC_DOUBLE_LADDER_OUT_ERROR  /*!< PKA ECC double base ladder
                                                                                            result error             */
#define PKA_OPERATION_ECC_PROJECTIVE_AFF_ERROR_OFFSET PKA_ECC_PROJECTIVE_AFF_OUT_ERROR /*!< PKA ECC projective affine
                                                                                            result error             */
/**
  * @}
  */

/* Private macros ----------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Private_Macros PKA Private Macros
  * @{
  */
/**
  * @brief Get the PKA instance.
  */
#define PKA_GET_INSTANCE(handle) ((PKA_TypeDef *)((uint32_t)(handle)->instance))

/**
  * @brief PKA RAM word access.
  */
#define PKA_RAM_WORD_ACCESS(handle, idx) (*(volatile uint32_t *)(uint32_t) \
                                          &((PKA_TypeDef *)((uint32_t)(handle)->instance))->RAM[idx * 4U])
/**
  * @}
  */

/* Private functions -------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Private_Functions PKA Private Functions
  * @{
  */
static void         PKA_SetConfigArithmetic(hal_pka_handle_t *hpka, const uint32_t size_byte,
                                            const uint8_t *p_operand_1, const uint8_t *p_operand_2,
                                            const uint8_t *p_operand_3);
static hal_status_t PKA_CheckError(hal_pka_handle_t *hpka, uint32_t operation);
static uint32_t     PKA_CheckRAMError(hal_pka_handle_t *hpka, uint32_t operation);
static uint32_t     PKA_GetOptBitSize_u8(uint32_t nbr_byte, uint8_t msb);
static void         PKA_Memcpy_u8_to_u32(volatile uint32_t *p_dst, const uint8_t *p_src, size_t nbr_byte);
static void         PKA_Memcpy_u8_to_u8(volatile uint8_t *p_dst, volatile const uint8_t *p_src, size_t nbr_byte);
static hal_status_t PKA_WaitInitOkUntilTimeout(hal_pka_handle_t *hpka, uint32_t flag_state,
                                               uint32_t timeout_ms);
static hal_status_t PKA_WaitPkaEnableUntilTimeout(hal_pka_handle_t *hpka, uint32_t flag_state,
                                                  uint32_t timeout_ms);
static uint32_t     PKA_GetResultSize(const hal_pka_handle_t *hpka, uint32_t start_index, uint32_t max_size);
#if defined (USE_HAL_PKA_RNG_RECOVERY) && (USE_HAL_PKA_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
hal_status_t PKA_RNG_ResilientRecoverSeedError(void);
#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_PKA_RNG_RECOVERY */
/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @addtogroup PKA_Exported_Functions
  * @{
  */

/** @addtogroup PKA_Exported_Functions_Group1
  * @{
This sub-section provides a set of functions allowing to initialize and de-initialize the PKA peripheral:

