MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
- Call the function HAL_PKA_Init() to initialize the HAL PKA handle and associate a PKA peripheral instance.
- Call the function HAL_PKA_DeInit() to de-initialize the HAL PKA instance by stopping any ongoing process and
  resetting the state machine.

  */

/**
  * @brief  Initialize the PKA handle and associate physical instance.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  instance          Specify the PKA instance.
  * @retval HAL_INVALID_PARAM Invalid parameter when hpka pointer is NULL.
  * @retval HAL_ERROR   Returned when the PKA is not correctly initialized; this check is performed when PKA_SR_CCEN
                        flag is defined.
  * @retval HAL_OK      Returned when the PKA is successfully initialized.

  */
hal_status_t HAL_PKA_Init(hal_pka_handle_t *hpka, hal_pka_t instance)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(IS_PKA_ALL_INSTANCE((PKA_TypeDef *)((uint32_t)instance)));
  /* to check  if chaining mode is active */

  if (LL_PKA_IsActiveFlag((PKA_TypeDef *)((uint32_t)instance), LL_PKA_FLAG_CCEN) == 1U)
  {
    return HAL_ERROR;
  }
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
     || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

  hpka->instance = instance;

#if defined(USE_HAL_PKA_CLK_ENABLE_MODEL) && (USE_HAL_PKA_CLK_ENABLE_MODEL > HAL_CLK_ENABLE_NO)
  HAL_RCC_PKA_EnableClock();
#endif /* USE_HAL_PKA_CLK_ENABLE_MODEL */

#if defined (USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1)
  hpka->p_operation_cplt_cb = HAL_PKA_OperationCpltCallback;
  hpka->p_error_cb          = HAL_PKA_ErrorCallback;
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */

#if defined(USE_HAL_PKA_USER_DATA) && (USE_HAL_PKA_USER_DATA == 1)
  hpka->p_user_data = NULL;
#endif /* USE_HAL_PKA_USER_DATA */

#if defined (USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->global_state = HAL_PKA_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief De-initialize the PKA handle by aborting any PKA operation in progress.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  */
void HAL_PKA_DeInit(hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(IS_PKA_ALL_INSTANCE(PKA_GET_INSTANCE(hpka)));

  LL_PKA_Disable(PKA_GET_INSTANCE(hpka));
  LL_PKA_ClearFlag(PKA_GET_INSTANCE(hpka), LL_PKA_FLAG_ALL);

  hpka->global_state = HAL_PKA_STATE_RESET;
}
/**
  * @}
  */

/** @addtogroup PKA_Exported_Functions_Group2
  * @{
This sub-section provides a set of functions allowing to configure the PKA operations.


  PKA Modular exponentiation configuration functions

- Call the function HAL_PKA_SetConfigModExp() to configure the Modular exponentiation operation.
- Call the function HAL_PKA_SetConfigModExpFast() to configure the Modular exponentiation (fast) operation.
- Call the function HAL_PKA_SetConfigModExpProtect() to configure the Modular exponentiation (protected) operation
when the mode is supported.

  PKA arithmetic configuration functions

- Call the function HAL_PKA_SetConfigAdd() to configure the Arithmetic addition operation.
- Call the function HAL_PKA_SetConfigSub() to configure the Arithmetic subtraction operation.
- Call the function HAL_PKA_SetConfigCmp() to configure the Arithmetic comparison operation.
- Call the function HAL_PKA_SetConfigMul() to configure the Arithmetic multiplication operation.
- Call the function HAL_PKA_SetConfigModAdd() to configure the Modular addition operation.
- Call the function HAL_PKA_SetConfigModSub() to configure the Modular subtraction operation.
- Call the function HAL_PKA_SetConfigModInv() to configure the Modular inversion operation.
- Call the function HAL_PKA_SetConfigModRed() to configure the Modular reduction operation.
- Call the function HAL_PKA_SetConfigMontgomeryMul() to configure the Montgomery multiplication operation.
- Call the function HAL_PKA_SetConfigMontgomery() to configure the Montgomery parameter operation.

  PKA RSA configuration functions

- Call the function HAL_PKA_RSA_SetConfigCRTExp() to configure the RSA CRT exponentiation operation.
- Call the function HAL_PKA_RSA_SetConfigSignature() to configure the RSA signature operation.
- Call the function HAL_PKA_RSA_SetConfigSignatureFast() to configure the RSA signature (fast) operation.
- Call the function HAL_PKA_RSA_SetConfigSignatureProtect() to configure the RSA signature (protected) operation
when the mode is supported.
- Call the function HAL_PKA_RSA_SetConfigVerifSignature() to configure the RSA verification operation.

  PKA ECDSA configuration functions

- Call the function HAL_PKA_ECDSA_SetConfigSignatureProtect() to configure the elliptic curves over prime fields
signature (protected) operation when the mode is supported.
- Call the function HAL_PKA_ECDSA_SetConfigVerifSignature() to configure the elliptic curves over prime fields
  verification operation.

  PKA ECC configuration functions

- Call the function HAL_PKA_ECC_SetConfigPointCheck() to configure the Point on elliptic curve check operation.
- Call the function HAL_PKA_ECC_SetConfigMulProtect() to configure the ECC scalar multiplication (protected) operation
when the mode is supported.
- Call the function HAL_PKA_ECC_SetConfigDoubleBaseLadder() to configure the ECC double base ladder operation.
- Call the function HAL_PKA_ECC_SetConfigProjectiveToAffine() to configure the ECC projective to affine operation.
- Call the function HAL_PKA_ECC_SetConfigCompleteAdd() to configure the ECC complete addition operation.
  */

/**
  * @brief  Set the modular exponentiation configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_mod_exp_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            Modular exponentiation is successfully configured.
  */
hal_status_t HAL_PKA_SetConfigModExp(hal_pka_handle_t *hpka, const hal_pka_mod_exp_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_exponent != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->exponent_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->operand_size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

