MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
  hpka->operation    = PKA_OPERATION_ECDSA_SIGN_PROT_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the configuration for verifying the validity of a signature using elliptic curves over prime fields.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_ecdsa_verif_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            The verification of signature validity is successfully configured.
  */
hal_status_t HAL_PKA_ECDSA_SetConfigVerifSignature(hal_pka_handle_t *hpka, const hal_pka_ecdsa_verif_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_coeff != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->p_r_sign != NULL);
  ASSERT_DBG_PARAM(p_config->p_s_sign != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_x != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_y != NULL);
  ASSERT_DBG_PARAM(p_config->p_hash != NULL);
  ASSERT_DBG_PARAM(p_config->p_pub_key_curve_pt_x != NULL);
  ASSERT_DBG_PARAM(p_config->p_pub_key_curve_pt_y != NULL);
  ASSERT_DBG_PARAM(p_config->p_prime_order != NULL);
  ASSERT_DBG_PARAM(p_config->prime_order_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->coeff_sign == 0U || p_config->coeff_sign == 1U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_coeff == NULL) || (p_config->p_modulus == NULL) || (p_config->p_hash == NULL) \
      || (p_config->p_r_sign == NULL) || (p_config->p_s_sign == NULL) || (p_config->p_base_pt_x == NULL)               \
      || (p_config->p_base_pt_y == NULL) || (p_config->p_pub_key_curve_pt_x == NULL)                                   \
      || (p_config->p_pub_key_curve_pt_y == NULL) || (p_config->p_prime_order == NULL)                                 \
      || (p_config->prime_order_size_byte == 0U) || (p_config->modulus_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_ECDSA_VERIFICATION);

  PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_ORDER_NB_BITS) = PKA_GetOptBitSize_u8(p_config->prime_order_size_byte,
                                                                *(p_config->p_prime_order));
  PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_MOD_NB_BITS)   = PKA_GetOptBitSize_u8(p_config->modulus_size_byte,
                                                                *(p_config->p_modulus));
  PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_A_COEFF_SIGN)  = p_config->coeff_sign;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_A_COEFF), p_config->p_coeff,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_MOD_GF), p_config->p_modulus,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_INITIAL_POINT_X), p_config->p_base_pt_x,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_INITIAL_POINT_Y), p_config->p_base_pt_y,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_X),
                       p_config->p_pub_key_curve_pt_x, p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_PUBLIC_KEY_POINT_Y),
                       p_config->p_pub_key_curve_pt_y, p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_SIGNATURE_R), p_config->p_r_sign,
                       p_config->prime_order_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_SIGNATURE_S), p_config->p_s_sign,
                       p_config->prime_order_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_HASH_E), p_config->p_hash,
                       p_config->prime_order_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_IN_ORDER_N), p_config->p_prime_order,
                       p_config->prime_order_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the RSA CRT exponentiation configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_rsa_crt_exp_config_t  configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            RSA CRT exponentiation is successfully configured.
  */
hal_status_t HAL_PKA_RSA_SetConfigCRTExp(hal_pka_handle_t *hpka, const hal_pka_rsa_crt_exp_config_t  *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_a != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_dp != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_dq != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_qinv != NULL);
  ASSERT_DBG_PARAM(p_config->p_prime_p != NULL);
  ASSERT_DBG_PARAM(p_config->p_prime_q != NULL);
  ASSERT_DBG_PARAM(p_config->size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

