MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_modulus == NULL) || (p_config->p_private_key == NULL) \
      || (p_config->p_hash == NULL) || (p_config->p_montgomery_param == NULL) \
      || (p_config->private_key_size_byte == 0U) || (p_config->hash_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_RSA_SIGNATURE_FAST);

  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_OP_NB_BITS)  = p_config->hash_size_byte * 8UL;
  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_EXP_NB_BITS) = p_config->private_key_size_byte * 8UL;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_EXPONENT_BASE), p_config->p_hash,
                       p_config->hash_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_EXPONENT), p_config->p_private_key,
                       p_config->private_key_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_MODULUS), p_config->p_modulus,
                       p_config->hash_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_MONTGOMERY_PARAM),
                       p_config->p_montgomery_param, p_config->hash_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the message signature (protected) configuration using RSA CRT exponentiation.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_rsa_signature_protect_config_t  configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            RSA CRT exponentiation is successfully configured.
  */
hal_status_t HAL_PKA_RSA_SetConfigSignatureProtect(hal_pka_handle_t *hpka,
                                                   const hal_pka_rsa_signature_protect_config_t  *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->p_private_key != NULL);
  ASSERT_DBG_PARAM(p_config->p_hash != NULL);
  ASSERT_DBG_PARAM(p_config->p_phi != NULL);
  ASSERT_DBG_PARAM(p_config->private_key_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->hash_size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_modulus == NULL) || (p_config->p_private_key == NULL) \
      || (p_config->p_hash == NULL) || (p_config->p_phi == NULL) \
      || (p_config->private_key_size_byte == 0U) || (p_config->hash_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_RSA_SIGNATURE_PROTECT);

  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_OP_NB_BITS)  = p_config->hash_size_byte * 8UL;
  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_IN_EXP_NB_BITS) = p_config->private_key_size_byte * 8UL;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT_BASE), p_config->p_hash,
                       p_config->hash_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_PROTECT_IN_EXPONENT), p_config->p_private_key,
                       p_config->private_key_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_PROTECT_IN_MODULUS), p_config->p_modulus,
                       p_config->hash_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_EXP_PROTECT_IN_PHI),
                       p_config->p_phi, p_config->hash_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_MOD_EXP_PROT_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the configuration for verifying the validity of a signature using RSA CRT exponentiation.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_rsa_verif_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            The verification of signature validity is successfully configured.
  */
hal_status_t HAL_PKA_RSA_SetConfigVerifSignature(hal_pka_handle_t *hpka, const hal_pka_rsa_verif_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->p_public_key != NULL);
  ASSERT_DBG_PARAM(p_config->p_sign != NULL);
  ASSERT_DBG_PARAM(p_config->public_key_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->sign_size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

