MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_operand_1 == NULL) || (p_config->p_operand_2 == NULL) \
      || (p_config->p_operand_3 == NULL) || (p_config->size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_MODULAR_SUB);

  PKA_SetConfigArithmetic(hpka, p_config->size_byte, p_config->p_operand_1, p_config->p_operand_2,
                          p_config->p_operand_3);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set modular inversion configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_mod_inv_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            Modular inversion is successfully configured.
  */
hal_status_t HAL_PKA_SetConfigModInv(hal_pka_handle_t *hpka, const hal_pka_mod_inv_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_operand == NULL) || (p_config->p_modulus == NULL) \
      || (p_config->size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_MODULAR_INV);

  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_INV_NB_BITS) = p_config->size_byte * 8UL;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_INV_IN_OP1), p_config->p_operand, p_config->size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_INV_IN_OP2_MOD), p_config->p_modulus,
                       p_config->size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set the modular reduction configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_mod_red_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            Modular reduction is successfully configured.
  */
hal_status_t HAL_PKA_SetConfigModRed(hal_pka_handle_t *hpka, const hal_pka_mod_red_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->operand_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->modulus_size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_operand == NULL) || (p_config->p_modulus == NULL) \
      || (p_config->operand_size_byte == 0U) || (p_config->modulus_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_MODULAR_REDUC);

  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_REDUC_IN_OP_LENGTH)  = p_config->operand_size_byte * 8UL;
  PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_REDUC_IN_MOD_LENGTH) = p_config->modulus_size_byte * 8UL;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_REDUC_IN_OPERAND), p_config->p_operand,
                       p_config->operand_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_REDUC_IN_MODULUS), p_config->p_modulus,
                       p_config->modulus_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set Montgomery multiplication configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_montgomery_mul_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            Montgomery multiplication is successfully configured.
  */
hal_status_t HAL_PKA_SetConfigMontgomeryMul(hal_pka_handle_t *hpka, const hal_pka_montgomery_mul_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_1 != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_2 != NULL);
  ASSERT_DBG_PARAM(p_config->p_operand_3 != NULL);
  ASSERT_DBG_PARAM(p_config->size_byte != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

