MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_modulus == NULL) || (p_config->p_base_pt_x == NULL)                          \
      || (p_config->p_base_pt_y == NULL) || (p_config->p_base_pt_z == NULL) || (p_config->p_montgomery_param == NULL) \
      || (p_config->modulus_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_ECC_PROJECTIVE_AFF);

  PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_MOD_NB_BITS) = p_config->modulus_size_byte * 8UL;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_MOD_P), p_config->p_modulus,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_POINT_X), p_config->p_base_pt_x,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_POINT_Y), p_config->p_base_pt_y,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_POINT_Z), p_config->p_base_pt_z,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_PROJECTIVE_AFF_IN_MONTGOMERY_PARAM_R2),
                       p_config->p_montgomery_param, p_config->modulus_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_ECC_PROJECTIVE_AFF_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @brief  Set ECC complete addition configuration.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_config          Pointer to @ref hal_pka_ecc_complete_add_config_t configuration structure.
  * @retval HAL_INVALID_PARAM Invalid parameter return when p_config pointer is NULL.
  * @retval HAL_ERROR         PKA is not correctly initialized.
  * @retval HAL_OK            ECC complete addition is successfully configured.
  */
hal_status_t HAL_PKA_ECC_SetConfigCompleteAdd(hal_pka_handle_t *hpka, const hal_pka_ecc_complete_add_config_t *p_config)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_config != NULL);
  ASSERT_DBG_PARAM(p_config->p_modulus != NULL);
  ASSERT_DBG_PARAM(p_config->p_coeff_a != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_x_1 != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_y_1 != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_z_1 != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_x_2 != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_y_2 != NULL);
  ASSERT_DBG_PARAM(p_config->p_base_pt_z_2 != NULL);
  ASSERT_DBG_PARAM(p_config->modulus_size_byte != 0U);
  ASSERT_DBG_PARAM(p_config->coeff_sign == 0U || p_config->coeff_sign == 1U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if ((p_config == NULL) || (p_config->p_modulus == NULL) || (p_config->p_coeff_a == NULL)                           \
      || (p_config->p_base_pt_x_1 == NULL) || (p_config->p_base_pt_y_1 == NULL) || (p_config->p_base_pt_z_1 == NULL) \
      || (p_config->p_base_pt_x_2 == NULL) || (p_config->p_base_pt_y_2 == NULL) || (p_config->p_base_pt_z_2 == NULL) \
      || (p_config->modulus_size_byte == 0U))
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  /* Set PKA enable */
  if (PKA_WaitPkaEnableUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  if (PKA_WaitInitOkUntilTimeout(hpka, 0UL, PKA_INITIALIZATION_TIMEOUT) != HAL_OK)
  {
    return HAL_ERROR;
  }

  LL_PKA_SetMode(PKA_GET_INSTANCE(hpka), LL_PKA_MODE_ECC_COMPLETE_ADD);

  PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_MOD_NB_BITS)   = p_config->modulus_size_byte * 8UL;
  PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_DOUBLE_LADDER_IN_A_COEFF_SIGN) = p_config->coeff_sign;
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_MOD_P), p_config->p_modulus,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_A_COEFF), p_config->p_coeff_a,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT1_X), p_config->p_base_pt_x_1,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT1_Y), p_config->p_base_pt_y_1,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT1_Z), p_config->p_base_pt_z_1,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT2_X), p_config->p_base_pt_x_2,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT2_Y), p_config->p_base_pt_y_2,
                       p_config->modulus_size_byte);
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ECC_COMPLETE_ADD_IN_POINT2_Z), p_config->p_base_pt_z_2,
                       p_config->modulus_size_byte);

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = HAL_PKA_ERROR_NONE;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  hpka->operation    = PKA_OPERATION_NO_ERROR_OFFSET;
  hpka->global_state = HAL_PKA_STATE_IDLE;

  return HAL_OK;
}

/**
  * @}
  */

/** @addtogroup PKA_Exported_Functions_Group3
  * @{
This sub-section provides a set of functions allowing to manage the calculation data for an operation.

PKA calculating process functions

- Call the function HAL_PKA_Compute() to start the computation in blocking mode.
- Call the function HAL_PKA_Compute_IT() to start the computation in interrupt mode.

