MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
- Call the function HAL_PKA_IRQHandler() to handle PKA event interrupt request.
- Call the function HAL_PKA_Abort() to abort any ongoing operation.

PKA Modular exponentiation result functions

- Call the function HAL_PKA_GetResultModExp() to retrieve the result of the Modular exponentiation operation.
- Call the function HAL_PKA_GetResultModExpFast() to retrieve the result of the Modular exponentiation (Fast) operation.
- Call the function HAL_PKA_GetResultModExpProtect() to retrieve the result of the Modular exponentiation (Protected)
operation when the mode is supported.

  PKA arithmetic result functions

- Call the function HAL_PKA_GetResultAdd() to retrieve the result of the addition operation.
- Call the function HAL_PKA_GetResultSub() to retrieve the result of the subtraction operation.
- Call the function HAL_PKA_GetResultMul() to retrieve the result of the multiplication operation.
- Call the function HAL_PKA_GetResultCmp() to retrieve the result of the comparison operation.
- Call the function HAL_PKA_GetResultModAdd() to retrieve the result of the Modular Addition operation.
- Call the function HAL_PKA_GetResultModSub() to retrieve the result of the Modular subtraction operation.
- Call the function HAL_PKA_GetResultModInv() to retrieve the result of the modular inversion operation.
- Call the function HAL_PKA_GetResultModRed() to retrieve the result of the modular reduction operation.
- Call the function HAL_PKA_GetResultMontgomeryMul() to retrieve the result of the Montgomery parameter operation.
- Call the function HAL_PKA_GetResultMontgomery() to retrieve the result of the Montgomery parameter operation.

  PKA RSA result functions

- Call the function HAL_PKA_RSA_GetResultCRTExp() to retrieve the result of RSA CRT exponentiation operation.
- Call the function HAL_PKA_RSA_GetResultSignature() to retrieve the result of the RSA signature operation.
- Call the function HAL_PKA_RSA_GetResultSignatureFast() to retrieve the result of the RSA signature (fast) operation.
- Call the function HAL_PKA_RSA_GetResultSignatureProtect() to retrieve the result of the RSA signature (protected)
operation when the mode is supported.
- Call the function HAL_PKA_RSA_IsValidVerifSignature() to check if the signature is verified.

  PKA ECDSA result functions

- Call the function HAL_PKA_ECDSA_GetResultSignatureProtect() to retrieve the result of elliptic curves over prime
fields signature (protected) operation when the mode is supported.
- Call the function HAL_PKA_ECDSA_IsValidVerifSignature() to check if the signature is verified.

  PKA ECC result functions

- Call the function HAL_PKA_ECC_IsPointCheckOnCurve() to check if the point is on the curve.
- Call the function HAL_PKA_ECC_GetResultMulProtect() to retrieve the result of ECC scalar multiplication (protected)
operation when the mode is supported.
- Call the function HAL_PKA_ECC_GetResultDoubleBaseLadder() to retrieve the result of ECC double base ladder operation.
- Call the function HAL_PKA_ECC_GetResultProjectiveToAffine() to retrieve the result of ECC projective to affine
  operation.
- Call the function HAL_PKA_ECC_GetResultCompleteAdd() to retrieve the result of ECC complete addition operation.

  */

/**
  * @brief  Generic function to start a PKA operation in blocking mode.
  * @param  hpka              PKA handle.
  * @param  timeout_ms        Timeout duration.
  * @retval HAL_INVALID_PARAM Invalid parameter return when hpka pointer or timeout_ms are NULL.
  * @retval HAL_TIMEOUT       In case of user timeout.
  * @retval HAL_ERROR         PKA error is occurred.
  * @retval HAL_BUSY          PKA state is active when calling this API.
  * @retval HAL_OK            Operation is successfully computed.
  */
hal_status_t HAL_PKA_Compute(hal_pka_handle_t *hpka, uint32_t timeout_ms)
{
  hal_status_t status = HAL_TIMEOUT;
  uint32_t tickstart  = HAL_GetTick();

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(timeout_ms != 0U);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_IDLE);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (timeout_ms == 0U)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hpka, global_state, HAL_PKA_STATE_IDLE, HAL_PKA_STATE_ACTIVE);

  /* Start the computation */
  LL_PKA_Start(PKA_GET_INSTANCE(hpka));
  while ((PKA_GET_INSTANCE(hpka)->SR & PKA_SR_PROCENDF) == 0UL)
  {
    if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0UL))
    {
      if ((PKA_GET_INSTANCE(hpka)->SR & PKA_SR_PROCENDF) == 0UL)
      {
        /* Abort any ongoing operation */
        LL_PKA_Disable(PKA_GET_INSTANCE(hpka));
        LL_PKA_Enable(PKA_GET_INSTANCE(hpka));

        hpka->global_state = HAL_PKA_STATE_INIT;

        return status;
      }
    }
  }

  LL_PKA_ClearFlag_PROCEND(PKA_GET_INSTANCE(hpka));

  status = PKA_CheckError(hpka, hpka->operation);

  hpka->global_state = HAL_PKA_STATE_INIT;

  return status;
}

/**
  * @brief  Generic function to start a PKA operation in non-blocking mode with interrupt.
  * @param  hpka              PKA handle.
  * @retval HAL_INVALID_PARAM Invalid parameter return when hpka pointer is NULL.
  * @retval HAL_BUSY          PKA state is active when calling this API.
  * @retval HAL_OK            Operation is successfully computed.
  */
hal_status_t HAL_PKA_Compute_IT(hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_IDLE);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  HAL_CHECK_UPDATE_STATE(hpka, global_state, HAL_PKA_STATE_IDLE, HAL_PKA_STATE_ACTIVE);

