MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
  LL_PKA_EnableIT(PKA_GET_INSTANCE(hpka), LL_PKA_IT_ALL);

  LL_PKA_Start(PKA_GET_INSTANCE(hpka));

  return HAL_OK;
}

/**
  * @brief  This function handles PKA event interrupt request.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  */
void HAL_PKA_IRQHandler(hal_pka_handle_t *hpka)
{
  uint32_t flag_status;

  ASSERT_DBG_PARAM(hpka != NULL);

  flag_status = LL_PKA_READ_REG(PKA_GET_INSTANCE(hpka), SR);

  if ((flag_status & LL_PKA_FLAG_PROCEND) != 0UL)
  {
    LL_PKA_ClearFlag_PROCEND(PKA_GET_INSTANCE(hpka));

    hpka->global_state = HAL_PKA_STATE_INIT;

#if defined (USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1)
    hpka->p_operation_cplt_cb(hpka);
#else
    HAL_PKA_OperationCpltCallback(hpka);
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */

    return;
  }

  if ((flag_status & LL_PKA_FLAG_ERROR_ALL) != 0UL)
  {
#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
    hpka->last_error_codes = flag_status & LL_PKA_FLAG_ERROR_ALL;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

    LL_PKA_ClearFlag(PKA_GET_INSTANCE(hpka), LL_PKA_FLAG_ERROR_ALL);

#if defined (USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1)
    hpka->p_error_cb(hpka);
#else
    HAL_PKA_ErrorCallback(hpka);
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */
  }
}

/**
  * @brief  Abort any ongoing operation.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval HAL_INVALID_PARAM Invalid parameter return when hpka pointer is NULL.
  * @retval HAL_OK            Operation is successfully aborted.
  */
hal_status_t HAL_PKA_Abort(hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  ASSERT_DBG_STATE(hpka->global_state, (uint32_t)HAL_PKA_STATE_IDLE | (uint32_t)HAL_PKA_STATE_ACTIVE);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  LL_PKA_Disable(PKA_GET_INSTANCE(hpka));

  LL_PKA_ClearFlag(PKA_GET_INSTANCE(hpka), LL_PKA_FLAG_ALL);

  hpka->global_state = HAL_PKA_STATE_INIT;

  return HAL_OK;
}

/**
  * @brief  Retrieve Modular exponentiation operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModExp(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4U], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Modular exponentiation (Fast) operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModExpFast(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4U], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Modular exponentiation (Protected) operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of result error or invalid parameter.
  */
uint32_t HAL_PKA_GetResultModExpProtect(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_MOD_EXP_PROT_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4UL, PKA_ROS_RESULT_MAX_SIZE);
    PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4UL], size_byte);
  }

  return size_byte;
}


/**
  * @brief  Retrieve ECDSA signature (protected) operation result.
  * @param  hpka         Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result     Pointer to @ref hal_pka_ecdsa_signature_protect_result_t result structure.
  * @param  p_result_ext Pointer to @ref hal_pka_ecdsa_signature_result_ext_config_t structure (optional).
  * @retval size_byte    Size of result in bytes.
  * @note                The retrieved data are in big-endian format and start at the base address of the user buffer.
  *                      The returned size corresponds to the maximum effective size of the signature components and
  *                      the coordinates.
  * @retval 0            In case of result error or invalid parameter.
  */
uint32_t HAL_PKA_ECDSA_GetResultSignatureProtect(hal_pka_handle_t *hpka,
                                                 hal_pka_ecdsa_signature_protect_result_t *p_result,
                                                 hal_pka_ecdsa_signature_result_ext_config_t *p_result_ext)
{
  PKA_TypeDef *pka_instance;
  uint32_t size_byte = 0U;
  uint32_t size_byte_r = 0U;
  uint32_t size_byte_s = 0U;
  uint32_t size_byte_x = 0U;
  uint32_t size_byte_y = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);
  ASSERT_DBG_PARAM(p_result->p_r_sign != NULL);
  ASSERT_DBG_PARAM(p_result->p_s_sign != NULL);
  ASSERT_DBG_PARAM(p_result_ext != NULL);
  ASSERT_DBG_PARAM(p_result_ext->p_pt_x != NULL);
  ASSERT_DBG_PARAM(p_result_ext->p_pt_y != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

