MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL)  || (p_result->p_r_sign == NULL) || (p_result->p_s_sign == NULL) \
      || (p_result_ext == NULL) || (p_result_ext->p_pt_x == NULL) || (p_result_ext->p_pt_y == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  pka_instance = PKA_GET_INSTANCE(hpka);

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_ECDSA_SIGN_PROT_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte_r = PKA_GetResultSize(hpka, PKA_ECDSA_SIGN_OUT_SIGNATURE_R * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_s = PKA_GetResultSize(hpka, PKA_ECDSA_SIGN_OUT_SIGNATURE_S * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_x = PKA_GetResultSize(hpka, PKA_ECDSA_SIGN_OUT_FINAL_POINT_X * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_y = PKA_GetResultSize(hpka, PKA_ECDSA_SIGN_OUT_FINAL_POINT_Y * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte = ((((size_byte_r > size_byte_s) ? size_byte_r : size_byte_s) >
                  ((size_byte_x > size_byte_y) ? size_byte_x : size_byte_y)) ?
                 ((size_byte_r > size_byte_s) ? size_byte_r : size_byte_s) :
                 ((size_byte_x > size_byte_y) ? size_byte_x : size_byte_y));
    PKA_Memcpy_u8_to_u8(p_result->p_r_sign, &pka_instance->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_R * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result->p_s_sign, &pka_instance->RAM[PKA_ECDSA_SIGN_OUT_SIGNATURE_S * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result_ext->p_pt_x, &pka_instance->RAM[PKA_ECDSA_SIGN_OUT_FINAL_POINT_X * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result_ext->p_pt_y, &pka_instance->RAM[PKA_ECDSA_SIGN_OUT_FINAL_POINT_Y * 4UL],
                        size_byte);
  }
  return size_byte;
}

/**
  * @brief  Retrieve ECDSA verification signature result.
  * @param  hpka                          Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval PKA_ECDSA_SIGNATURE_VALID     Signature validated.
  * @retval PKA_ECDSA_SIGNATURE_NOT_VALID In case of signature not validated or invalid parameter.
  */
hal_pka_ecdsa_signature_status_t HAL_PKA_ECDSA_IsValidVerifSignature(const hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return PKA_ECDSA_SIGNATURE_NOT_VALID;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  return (PKA_RAM_WORD_ACCESS(hpka, PKA_ECDSA_VERIF_OUT_RESULT) != PKA_OPERATION_ERROR_NONE) ?
         PKA_ECDSA_SIGNATURE_NOT_VALID : PKA_ECDSA_SIGNATURE_VALID;
}

/**
  * @brief  Retrieve RSA CRT exponentiation operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_RSA_GetResultCRTExp(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4UL,
                                (PKA_RAM_WORD_ACCESS(hpka, PKA_RSA_CRT_EXP_IN_MOD_NB_BITS) / 8U) + 1U);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_RSA_CRT_EXP_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve RSA signature operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_RSA_GetResultSignature(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve RSA signature (fast) operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_RSA_GetResultSignatureFast(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve RSA signature (protected) operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_RSA_GetResultSignatureProtect(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

