MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_MOD_EXP_PROT_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4UL, PKA_ROS_RESULT_MAX_SIZE);
    PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4UL], size_byte);
  }

  return size_byte;
}

/**
  * @brief  Retrieve RSA verification signature result.
  * @param  hpka                        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_hash                      Pointer to hashed message provided by the user.
  * @retval PKA_RSA_SIGNATURE_VALID     Signature validated.
  * @note                               The verification result is checked against the effective output data
  *                                     returned by the PKA in big-endian format.
  * @retval PKA_RSA_SIGNATURE_NOT_VALID In case of signature not validated or invalid parameter.
  */
hal_pka_rsa_signature_status_t HAL_PKA_RSA_IsValidVerifSignature(hal_pka_handle_t *hpka, const uint8_t *p_hash)
{
  uint32_t size_byte;
  uint32_t index;
  uint8_t  p_result[PKA_ROS_RESULT_MAX_SIZE * 8U] = {0};

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_hash != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_hash == NULL))
  {
    return PKA_RSA_SIGNATURE_NOT_VALID;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_EXP_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_EXP_OUT_RESULT * 4UL], size_byte);

  for (index = 0; index < size_byte; index++)
  {
    if (p_result[index] != p_hash[index])
    {
      return PKA_RSA_SIGNATURE_NOT_VALID;
    }
  }

  return PKA_RSA_SIGNATURE_VALID;
}

/**
  * @brief  Retrieve Addition operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultAdd(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL, (PKA_ROS_RESULT_MAX_SIZE + 1U));
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve subtraction operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultSub(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve multiplication operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultMul(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4U, (PKA_ROS_RESULT_MAX_SIZE * 2U));
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve comparison operation result.
  * @param  hpka                Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result            Pointer to operation result buffer.
  * @retval PKA_CMP_RESULT_SIZE Size of the comparison result in bytes.
  * @note                       The comparison result is returned in big-endian format and start
  *                             at the base address of the user buffer.
  * @retval 0                   In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultCmp(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

