MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return 0;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL],
                      PKA_CMP_RESULT_SIZE);

  return PKA_CMP_RESULT_SIZE;
}

/**
  * @brief  Retrieve Modular Addition operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModAdd(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Modular subtraction operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModSub(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_ARITHMETIC_ALL_OPS_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Modular Reduction operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModRed(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_REDUC_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_REDUC_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Modular Inversion operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultModInv(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MODULAR_INV_OUT_RESULT * 4UL,
                                (PKA_RAM_WORD_ACCESS(hpka, PKA_MODULAR_INV_NB_BITS) / 8U) + 1U);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MODULAR_INV_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Montgomery multiplication operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultMontgomeryMul(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MONTGOMERY_MUL_OUT_RESULT * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MONTGOMERY_MUL_OUT_RESULT * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve Montgomery parameter operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to operation result buffer.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_GetResultMontgomery(hal_pka_handle_t *hpka, uint8_t *p_result)
{
  uint32_t size_byte = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

