MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  size_byte = PKA_GetResultSize(hpka, PKA_MONTGOMERY_PARAM_OUT_PARAMETER * 4U, PKA_ROS_RESULT_MAX_SIZE);
  PKA_Memcpy_u8_to_u8(p_result, &PKA_GET_INSTANCE(hpka)->RAM[PKA_MONTGOMERY_PARAM_OUT_PARAMETER * 4UL], size_byte);

  return size_byte;
}

/**
  * @brief  Retrieve point-on-elliptic-curve check operation result.
  * @param  hpka                       Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval PKA_ECC_POINT_ON_CURVE     ECC point is on the curve.
  * @retval PKA_ECC_POINT_NOT_ON_CURVE When the ECC point is not on the curve or a parameter is invalid.
  */
hal_pka_ecc_point_status_t HAL_PKA_ECC_IsPointCheckOnCurve(const hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return PKA_ECC_POINT_NOT_ON_CURVE;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  return (PKA_RAM_WORD_ACCESS(hpka, PKA_POINT_CHECK_OUT_ERROR) != PKA_OPERATION_ERROR_NONE) ?
         PKA_ECC_POINT_NOT_ON_CURVE : PKA_ECC_POINT_ON_CURVE;
}


/**
  * @brief  Retrieve ECC scalar multiplication (protected) operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to @ref hal_pka_ecc_mul_protect_result_t result structure.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  *                   The returned size corresponds to the maximum effective size of the coordinates.
  * @retval 0         In case of result error or invalid parameter.
  */
uint32_t HAL_PKA_ECC_GetResultMulProtect(hal_pka_handle_t *hpka, hal_pka_ecc_mul_protect_result_t *p_result)
{
  PKA_TypeDef *pka_instance;
  uint32_t size_byte = 0U;
  uint32_t size_byte_x = 0U;
  uint32_t size_byte_y = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_x != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_y != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL) || (p_result->p_pt_x == NULL) || (p_result->p_pt_y == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  pka_instance = PKA_GET_INSTANCE(hpka);

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_ECC_SCALAR_MUL_PROT_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte_x = PKA_GetResultSize(hpka, PKA_ECC_SCALAR_MUL_OUT_RESULT_X * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_y = PKA_GetResultSize(hpka, PKA_ECC_SCALAR_MUL_OUT_RESULT_Y * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte = (size_byte_x > size_byte_y) ? size_byte_x : size_byte_y;
    PKA_Memcpy_u8_to_u8(p_result->p_pt_x, &pka_instance->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_X * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result->p_pt_y, &pka_instance->RAM[PKA_ECC_SCALAR_MUL_OUT_RESULT_Y * 4UL],
                        size_byte);
  }

  return size_byte;
}

/**
  * @brief  Retrieve ECC double base ladder operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to @ref hal_pka_ecc_double_base_ladder_result_t result structure.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  *                   The returned size corresponds to the maximum effective size of the coordinates.
  * @retval 0         In case of result error or invalid parameter.
  */
uint32_t HAL_PKA_ECC_GetResultDoubleBaseLadder(hal_pka_handle_t *hpka,
                                               hal_pka_ecc_double_base_ladder_result_t *p_result)
{
  PKA_TypeDef *pka_instance;
  uint32_t size_byte = 0U;
  uint32_t size_byte_x = 0U;
  uint32_t size_byte_y = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_x != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_y != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL) || (p_result->p_pt_x == NULL) || (p_result->p_pt_y == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  pka_instance = PKA_GET_INSTANCE(hpka);

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_ECC_DOUBLE_LADDER_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte_x = PKA_GetResultSize(hpka, PKA_ECC_DOUBLE_LADDER_OUT_RESULT_X * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_y = PKA_GetResultSize(hpka, PKA_ECC_DOUBLE_LADDER_OUT_RESULT_Y * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte = (size_byte_x > size_byte_y) ? size_byte_x : size_byte_y;
    PKA_Memcpy_u8_to_u8(p_result->p_pt_x, &pka_instance->RAM[PKA_ECC_DOUBLE_LADDER_OUT_RESULT_X * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result->p_pt_y, &pka_instance->RAM[PKA_ECC_DOUBLE_LADDER_OUT_RESULT_Y * 4UL],
                        size_byte);
  }

  return size_byte;
}

/**
  * @brief  Retrieve ECC projective to affine operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to @ref hal_pka_ecc_projective_to_affine_result_t result structure.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  *                   The returned size corresponds to the maximum effective size of the coordinates.
  * @retval 0         In case of result error or invalid parameter.
  */
uint32_t HAL_PKA_ECC_GetResultProjectiveToAffine(hal_pka_handle_t *hpka,
                                                 hal_pka_ecc_projective_to_affine_result_t *p_result)
{
  PKA_TypeDef *pka_instance;
  uint32_t size_byte = 0U;
  uint32_t size_byte_x = 0U;
  uint32_t size_byte_y = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_x != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_y != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

