MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL) || (p_result->p_pt_x == NULL) || (p_result->p_pt_y == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  pka_instance = PKA_GET_INSTANCE(hpka);

  if (PKA_CheckRAMError(hpka, PKA_OPERATION_ECC_PROJECTIVE_AFF_ERROR_OFFSET) == HAL_PKA_ERROR_NONE)
  {
    size_byte_x = PKA_GetResultSize(hpka, PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_X * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte_y = PKA_GetResultSize(hpka, PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_Y * 4U, PKA_EOS_RESULT_MAX_SIZE);
    size_byte = (size_byte_x > size_byte_y) ? size_byte_x : size_byte_y;
    PKA_Memcpy_u8_to_u8(p_result->p_pt_x, &pka_instance->RAM[PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_X * 4UL],
                        size_byte);
    PKA_Memcpy_u8_to_u8(p_result->p_pt_y, &pka_instance->RAM[PKA_ECC_PROJECTIVE_AFF_OUT_RESULT_Y * 4UL],
                        size_byte);
  }

  return size_byte;
}

/**
  * @brief  Retrieve ECC complete addition operation result.
  * @param  hpka      Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_result  Pointer to @ref hal_pka_ecc_complete_add_result_t result structure.
  * @retval size_byte Size of result in bytes.
  * @note             The retrieved data are in big-endian format and start at the base address of the user buffer.
  *                   The returned size corresponds to the maximum effective size of the coordinates.
  * @retval 0         In case of invalid parameter.
  */
uint32_t HAL_PKA_ECC_GetResultCompleteAdd(hal_pka_handle_t *hpka, hal_pka_ecc_complete_add_result_t *p_result)
{
  PKA_TypeDef *pka_instance;
  uint32_t size_byte = 0;
  uint32_t size_byte_x = 0U;
  uint32_t size_byte_y = 0U;
  uint32_t size_byte_z = 0U;

  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_result != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_x != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_y != NULL);
  ASSERT_DBG_PARAM(p_result->p_pt_z != NULL);

  ASSERT_DBG_STATE(hpka->global_state, HAL_PKA_STATE_INIT);

#if defined (USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if ((hpka == NULL) || (p_result == NULL) || (p_result->p_pt_x == NULL) || (p_result->p_pt_y == NULL) \
      || (p_result->p_pt_z == NULL))
  {
    return size_byte;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  pka_instance = PKA_GET_INSTANCE(hpka);

  size_byte_x = PKA_GetResultSize(hpka, PKA_ECC_COMPLETE_ADD_OUT_RESULT_X * 4U, PKA_EOS_RESULT_MAX_SIZE);
  size_byte_y = PKA_GetResultSize(hpka, PKA_ECC_COMPLETE_ADD_OUT_RESULT_Y * 4U, PKA_EOS_RESULT_MAX_SIZE);
  size_byte_z = PKA_GetResultSize(hpka, PKA_ECC_COMPLETE_ADD_OUT_RESULT_Z * 4U, PKA_EOS_RESULT_MAX_SIZE);
  size_byte = (size_byte_x > size_byte_y) ? ((size_byte_x > size_byte_z) ? size_byte_x : size_byte_z)
              : ((size_byte_y > size_byte_z) ? size_byte_y : size_byte_z);

  PKA_Memcpy_u8_to_u8(p_result->p_pt_x, &pka_instance->RAM[PKA_ECC_COMPLETE_ADD_OUT_RESULT_X * 4UL],
                      size_byte);
  PKA_Memcpy_u8_to_u8(p_result->p_pt_y, &pka_instance->RAM[PKA_ECC_COMPLETE_ADD_OUT_RESULT_Y * 4UL],
                      size_byte);
  PKA_Memcpy_u8_to_u8(p_result->p_pt_z, &pka_instance->RAM[PKA_ECC_COMPLETE_ADD_OUT_RESULT_Z * 4UL],
                      size_byte);

  return size_byte;
}

/**
  * @}
  */

/** @addtogroup PKA_Exported_Functions_Group4
  * @{
This sub-section provides a set of callback functions allowing you to register the PKA operation and error callbacks:

- The HAL_PKA_OperationCpltCallback() function is called when the process is complete.
- The HAL_PKA_ErrorCallback() function is called in case of an error.
- Call the function HAL_PKA_RegisterOperationCpltCallback() to register the PKA operation complete callback.
- Call the function HAL_PKA_RegisterErrorCallback() to register the PKA error callback.

  */

/**
  * @brief  Process completed callback.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  */
__WEAK void HAL_PKA_OperationCpltCallback(hal_pka_handle_t *hpka)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpka);

  /* NOTE : This function must not be modified. When the callback is needed,
            the HAL_PKA_OperationCpltCallback must be implemented in the user file */
}

/**
  * @brief  Error callback.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  */
__WEAK void HAL_PKA_ErrorCallback(hal_pka_handle_t *hpka)
{
  /* Prevent unused argument(s) compilation warning */
  STM32_UNUSED(hpka);

  /* NOTE : This function must not be modified. When the callback is needed,
            the HAL_PKA_ErrorCallback must be implemented in the user file */
}

#if defined (USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1)
/**
  * @brief  Register the PKA command complete Callback TO be used instead of
  *         the weak HAL_PKA_OperCpltCallback() predefined callback.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_callback        Pointer to @ref hal_pka_cb_t Callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_PKA_RegisterOperationCpltCallback(hal_pka_handle_t *hpka, hal_pka_cb_t  p_callback)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  hpka->p_operation_cplt_cb = p_callback;

  return HAL_OK;
}

/**
  * @brief  Register the PKA Error Callback to be used instead of
  *         the weak HAL_PKA_ErrorCallback() predefined callback.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_callback        Pointer to @ref hal_pka_cb_t Callback function.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            Register completed successfully.
  */
hal_status_t HAL_PKA_RegisterErrorCallback(hal_pka_handle_t *hpka, hal_pka_cb_t p_callback)
{
  ASSERT_DBG_PARAM(hpka != NULL);
  ASSERT_DBG_PARAM(p_callback != NULL);

