MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
#if (defined(USE_HAL_CHECK_PARAM) && (USE_HAL_CHECK_PARAM == 1)) \
  || (defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1))
  if (p_callback == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_CHECK_PARAM or USE_HAL_SECURE_CHECK_PARAM */
#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  hpka->p_error_cb = p_callback;

  return HAL_OK;
}
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */

/**
  * @}
  */

/** @addtogroup PKA_Exported_Functions_Group5
  * @{
This sub-section provides a set of functions allowing you to get the PKA state, error code, and data information:

- Call the function HAL_PKA_GetState() to get the current PKA state.
- Call the function HAL_PKA_GetLastErrorCodes() to get the last PKA hardware or software error codes.
- Call the function HAL_PKA_SetUserData() to set the PKA user data.
- Call the function HAL_PKA_GetUserData() to get the PKA user data.

  */

/**
  * @brief  Retrieve the PKA global state.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval hal_pka_state_t PKA state
  */
hal_pka_state_t HAL_PKA_GetState(const hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  return hpka->global_state;
}

#if defined (USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
/**
  * @brief  Retrieve the PKA error code.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval PKA error code.
  */
uint32_t HAL_PKA_GetLastErrorCodes(const hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  return hpka->last_error_codes;
}
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

#if defined(USE_HAL_PKA_USER_DATA) && (USE_HAL_PKA_USER_DATA == 1)
/**
  * @brief  Store the user data into the pka handle.
  * @param  hpka        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  p_user_data Pointer to the user data.
  */
void HAL_PKA_SetUserData(hal_pka_handle_t *hpka, const void *p_user_data)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  hpka->p_user_data = p_user_data;
}

/**
  * @brief  Retrieve the user data from the pka handle.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval Pointer to the user data.
  */
const void *HAL_PKA_GetUserData(const hal_pka_handle_t *hpka)
{
  ASSERT_DBG_PARAM(hpka != NULL);

  return (hpka->p_user_data);
}
#endif /* USE_HAL_PKA_USER_DATA */
/**
  * @}
  */

/** @addtogroup PKA_Exported_Functions_Group6
  * @{
This sub-section provides a function called HAL_PKA_RAMMassErase() allowing to erase the content of the PKA RAM.

  */

/**
  * @brief  Erase the content of PKA RAM.
  * @param  hpka              Pointer to @ref hal_pka_handle_t PKA handle.
  * @retval HAL_INVALID_PARAM Invalid parameter.
  * @retval HAL_OK            The content of PKA RAM is fully and successfully erased.
  */
hal_status_t HAL_PKA_RAMMassErase(hal_pka_handle_t *hpka)
{
  uint32_t index;

  ASSERT_DBG_PARAM(hpka != NULL);

  ASSERT_DBG_STATE(hpka->global_state, (uint32_t)HAL_PKA_STATE_INIT | (uint32_t)HAL_PKA_STATE_IDLE);

#if defined(USE_HAL_SECURE_CHECK_PARAM) && (USE_HAL_SECURE_CHECK_PARAM == 1)
  if (hpka == NULL)
  {
    return HAL_INVALID_PARAM;
  }
#endif /* USE_HAL_SECURE_CHECK_PARAM */

  for (index = 0; index < PKA_RAM_SIZE; index++)
  {
    PKA_RAM_WORD_ACCESS(hpka, index) = 0UL;
  }

  hpka->global_state = HAL_PKA_STATE_INIT;

  return HAL_OK;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup PKA_Private_Functions
  * @{
  */

/**
  * @brief  Set arithmetic configuration.
  * @param  hpka        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  size_byte   Size of the operand in bytes.
  * @param  p_operand_1 Generic pointer to input data.
  * @param  p_operand_2 Generic pointer to input data.
  * @param  p_operand_3 Generic pointer to input data.
  */
static void PKA_SetConfigArithmetic(hal_pka_handle_t *hpka, const uint32_t size_byte, const uint8_t *p_operand_1,
                                    const uint8_t *p_operand_2, const uint8_t *p_operand_3)
{
  /* Get the number of bits per operand */
  PKA_RAM_WORD_ACCESS(hpka, PKA_ARITHMETIC_ALL_OPS_NB_BITS)  = size_byte * 8UL;

  /* Set operand 1 */
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ARITHMETIC_ALL_OPS_IN_OP1), p_operand_1, size_byte);

  /* Set operand 2 */
  PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ARITHMETIC_ALL_OPS_IN_OP2), p_operand_2, size_byte);

  /* Set operand 3 when operand is not null */
  if (p_operand_3 != NULL)
  {
    PKA_Memcpy_u8_to_u32(&PKA_RAM_WORD_ACCESS(hpka, PKA_ARITHMETIC_ALL_OPS_IN_OP3), p_operand_3, size_byte);
  }
}

/**
  * @brief  PKA operation result error.
  * @param  hpka                 Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  operation            PKA operating mode.
  * @retval HAL_PKA_ERROR_RESULT A result error has occurred in the calculation of the PKA operation.
  * @retval HAL_PKA_ERROR_NONE   No error in calculating PKA operation.
  */
static uint32_t PKA_CheckRAMError(hal_pka_handle_t *hpka, uint32_t operation)
{
  uint32_t error = HAL_PKA_ERROR_RESULT;

  if ((uint32_t)PKA_RAM_WORD_ACCESS(hpka, operation) == PKA_OPERATION_ERROR_NONE)
  {
    error = HAL_PKA_ERROR_NONE;
  }

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = error;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  return error;
}

/**
  * @brief  Check the PKA error flags and the computation error for the selected operation.
  * @param  hpka Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  operation PKA operating mode.
  * @retval HAL_ERROR PKA error is occurred.
  * @retval HAL_OK    No PKA errors occurred.
  */
static hal_status_t PKA_CheckError(hal_pka_handle_t *hpka, uint32_t operation)
{
  hal_status_t status = HAL_ERROR;
  uint32_t     error;

  error = (LL_PKA_READ_REG(PKA_GET_INSTANCE(hpka), SR) & LL_PKA_FLAG_ERROR_ALL);
  if (operation != PKA_OPERATION_NO_ERROR_OFFSET)
  {
    error |= PKA_CheckRAMError(hpka, operation);
  }

#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1)
  hpka->last_error_codes = error;
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */

  LL_PKA_ClearFlag(PKA_GET_INSTANCE(hpka), LL_PKA_FLAG_ERROR_ALL);

  if (error == HAL_PKA_ERROR_NONE)
  {
    status = HAL_OK;
  }

