MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.c
  return status;
}

/**
  * @brief  Get optimal number of bits inside an array of bytes.
  * @param  nbr_byte Number of bytes inside the array.
  * @param  msb      Most significant uint8_t of the array.
  */
static uint32_t PKA_GetOptBitSize_u8(uint32_t nbr_byte, uint8_t msb)
{
  uint32_t position;

  position = 32UL - __CLZ(msb);

  return (((nbr_byte - 1UL) * 8UL) + position);
}

/**
  * @brief  Copy uint8_t array to uint32_t array to fit PKA number representation.
  * @param  p_dst    Pointer to destination.
  * @param  p_src    Pointer to source.
  * @param  nbr_byte Number of size_t to copy.
  */
static void PKA_Memcpy_u8_to_u32(volatile uint32_t *p_dst, const uint8_t *p_src, size_t nbr_byte)
{
  size_t nbr_words = (nbr_byte + 3U) >> 2U;
  size_t src_index = nbr_byte;

  for (size_t i = 0; i < nbr_words; i++)
  {
    uint32_t word = 0U;
    for (size_t j = 0; j < 4U; j++)
    {
      if (src_index == 0U) { break; }
      src_index--;
      word |= ((uint32_t)p_src[src_index]) << (j << 3U);
    }
    p_dst[i] = word;
  }
  /* Zero padding for the next two words */
  p_dst[nbr_words + 1U] = 0UL;
  p_dst[nbr_words + 2U] = 0UL;
}

/**
  * @brief  Copy uint8_t array to uint8_t array.
  * @param  p_dst    Pointer to destination.
  * @param  p_src    Pointer to source.
  * @param  nbr_byte Number of bytes to be handled.
  */
static void PKA_Memcpy_u8_to_u8(volatile uint8_t *p_dst, volatile const uint8_t *p_src, size_t nbr_byte)
{
  for (uint32_t index = nbr_byte; index > 0U; index--)
  {
    p_dst[nbr_byte - index] = p_src[index - 1U];
  }
}

/**
  * @brief  Wait for a flag state until timeout.
  * @param  hpka        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  flag_state  Flag state (SET or RESET).
  * @param  timeout_ms  Timeout duration.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_OK      Flag is correctly set.
  */
static hal_status_t PKA_WaitInitOkUntilTimeout(hal_pka_handle_t *hpka, uint32_t flag_state, uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();
  while (LL_PKA_IsActiveFlag_INITOK(PKA_GET_INSTANCE(hpka)) == flag_state)
  {
#if defined (USE_HAL_PKA_RNG_RECOVERY) && (USE_HAL_PKA_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
    /*Check if there is an RNG seed error */
    if (LL_RNG_IsActiveFlag_SECS(RNG) != 0U)
    {
      /* Attempt to recover from the seed error */
      if (PKA_RNG_ResilientRecoverSeedError() != HAL_OK)
      {
        return HAL_ERROR;
      }
    }

#endif /* RNG_HTSR0_RPERRX || RNG_HTSR1_ADERRX */
#endif /* USE_HAL_PKA_RNG_RECOVERY */
    if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
    {
      return HAL_TIMEOUT;
    }
  }

  return HAL_OK;
}

/**
  * @brief  Wait the enable bit Setting .
  * @param  hpka        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  flag_state  Flag state (SET or RESET).
  * @param  timeout_ms  Timeout duration.
  * @retval HAL_TIMEOUT In case of user timeout.
  * @retval HAL_OK      Flag is correctly set.
  */
static hal_status_t PKA_WaitPkaEnableUntilTimeout(hal_pka_handle_t *hpka, uint32_t flag_state, uint32_t timeout_ms)
{
  uint32_t tickstart = HAL_GetTick();
  /* Reset the control register and enable the PKA (wait the end of PKA RAM erase) */
  while (LL_PKA_IsEnabled(PKA_GET_INSTANCE(hpka)) == flag_state)
  {
    LL_PKA_Enable(PKA_GET_INSTANCE(hpka));

    /* Check the Timeout */
    if (((HAL_GetTick() - tickstart) > timeout_ms) || (timeout_ms == 0U))
    {
      return HAL_TIMEOUT;
    }
  }
  return HAL_OK;
}
/**
  * @brief  Retrieve the size of result.
  * @param  hpka        Pointer to @ref hal_pka_handle_t PKA handle.
  * @param  start_index Specify the start index of the result in the PKA RAM.
  * @param  max_size    Specify the possible max size of the result in words.
  */
static uint32_t PKA_GetResultSize(const hal_pka_handle_t *hpka, uint32_t start_index, uint32_t max_size)
{
  uint32_t current_index = max_size - 1U;

  while ((PKA_GET_INSTANCE(hpka)->RAM[start_index + current_index] == 0UL) && (current_index != 0UL))
  {
    current_index--;
  }

  return current_index + 1U;
}

#if defined (USE_HAL_PKA_RNG_RECOVERY) && (USE_HAL_PKA_RNG_RECOVERY == 1U)
#if defined(RNG_HTSR0_RPERRX) || defined(RNG_HTSR1_ADERRX)
/**
  * @brief  Attempts a robust recovery of the RNG after a seed error.
  *         Implements a sequence of health checks, oscillator re-masking
  *         and conditional resets to restore a valid RNG operating state.
  * @retval HAL_ERROR RNG could not be recovered within the configured timeouts.
  * @retval HAL_OK    RNG successfully recovered and no seed error is pending.
  */
hal_status_t PKA_RNG_ResilientRecoverSeedError(void)
{
  uint32_t timeout;
  uint32_t htsr_temp = 0U;
  uint32_t htsr_previous_temp = 0U;
  uint32_t htsr_count = 0U;
  uint32_t nsmr_temp = 0U;
  uint32_t tickstart1 = 0U;
  uint32_t tickstart2 = 0U;
  uint32_t tickstart3 = 0U;
  uint32_t oscillators_count = 0U;
  uint32_t config_b_fewer_than_6_osc_count = 0U;
  uint8_t count = 0U;

  /* timeout here is an emperic value */
  timeout = (1UL + ((1UL << (STM32_READ_BIT(RNG->CR, RNG_CR_CLKDIV) >> 16UL)) * PKA_RNG_TIMEOUT_VALUE / 8UL));
  LL_RNG_Enable(RNG);

  tickstart1 = HAL_GetTick();

  /* Check if seed error current status indicates no error and auto-reset succeeded */
  if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
  {
    /* Clear SEIS flag when automatic reset is activated */
    LL_RNG_ClearFlag_SEIS(RNG);
  }

  else  /* Sequence to fully recover from a seed error*/
  {
    if (LL_RNG_IsConfigLocked(RNG) == 0U)
    {
      do
      {
        if (LL_RNG_IsActiveFlag_SECS(RNG) == 0U)
        {
          break;
        }
        /* Read oscillator status registers combined */
        htsr_temp = LL_RNG_GetHealthTestStatus(RNG, 0U);
        htsr_temp |= LL_RNG_GetHealthTestStatus(RNG, 1U);
        if (htsr_temp > 0U)
        {
          /* If any oscillator status bits overlap with previous status, increment counter */
          if ((htsr_temp & htsr_previous_temp) != 0U)
          {
            htsr_count++;
          }

